Updated UML diagramm.
