--- a/README.md
+++ b/README.md
@@ -1,17 +1,39 @@
 
 ### Схема работы сервисов
 
-```mermaid
-graph TD;
-  Client-->ProductFacadeApi;
-  ProductFacadeApi-->UserManagerService;
-  UserManagerService-->ProductFacadeApi;
-  ProductFacadeApi-->Client;
-```
+<details> 
+<summary></summary>
+custom_mark13
+@startuml;
+actor User;
+participant "Client" as A;
+participant "ProductFacadeApi" as B;
+participant "UserManagementService" as C;
+User -> A: Authorize;
+activate A;
+A -> B: Create Request;
+activate B;
+B -> C: GetToken;
+activate C;
+C -> B: GetUser;
+deactivate C;
+B -> A: Response Created;
+deactivate B;
+A -> User: Login;
+deactivate A;
+User -> A: GetProducts;
+A -> B: Create Request
+deactivate C;
+B -> A: GetProductsPage;
+A -> User: Show Products List;
+@enduml
+custom_mark13
+</details>
+
